; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	image0 - mode
	image1 - mode
	Star0 - direction
	Star3 - direction
	Star6 - direction
	Star7 - direction
	Star1 - direction
	Star2 - direction
	GroundStation5 - direction
	Star4 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
	Star12 - direction
	Planet13 - direction
	Star14 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
	Planet18 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star12)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 Star2)
	(supports instrument2 image1)
	(calibration_target instrument2 Star4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star9)
)
(:goal (and
	(have_image Star8 image0)
	(have_image Star9 image0)
	(have_image Planet10 image0)
	(have_image Star11 image0)
	(have_image Star12 image0)
	(have_image Planet13 image1)
	(have_image Star14 image0)
	(have_image Planet15 image0)
	(have_image Phenomenon16 image0)
	(have_image Phenomenon17 image1)
	(have_image Planet18 image0)
))

)

; plan
1. (turn_to satellite0 star1 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star1)
   goals met: 0 of 11
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 11
3. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 0 of 11
4. (turn_to satellite0 planet10 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet10)
   goals met: 0 of 11
5. (take_image satellite0 planet10 instrument0 image0)
   added: (have_image planet10 image0)
   goals met: 1 of 11
6. (turn_to satellite0 phenomenon17 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon17)
   goals met: 1 of 11
7. (take_image satellite0 phenomenon17 instrument0 image1)
   added: (have_image phenomenon17 image1)
   goals met: 2 of 11
8. (turn_to satellite0 phenomenon16 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 phenomenon16)
   goals met: 2 of 11
9. (take_image satellite0 phenomenon16 instrument0 image0)
   added: (have_image phenomenon16 image0)
   goals met: 3 of 11
10. (turn_to satellite0 planet13 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 planet13)
   goals met: 3 of 11
11. (take_image satellite0 planet13 instrument0 image1)
   added: (have_image planet13 image1)
   goals met: 4 of 11
12. (turn_to satellite0 planet15 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet15)
   goals met: 4 of 11
13. (take_image satellite0 planet15 instrument0 image0)
   added: (have_image planet15 image0)
   goals met: 5 of 11
14. (turn_to satellite0 planet18 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet18)
   goals met: 5 of 11
15. (take_image satellite0 planet18 instrument0 image0)
   added: (have_image planet18 image0)
   goals met: 6 of 11
16. (turn_to satellite0 star11 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 star11)
   goals met: 6 of 11
17. (take_image satellite0 star11 instrument0 image0)
   added: (have_image star11 image0)
   goals met: 7 of 11
18. (turn_to satellite0 star12 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star12)
   goals met: 7 of 11
19. (take_image satellite0 star12 instrument0 image0)
   added: (have_image star12 image0)
   goals met: 8 of 11
20. (turn_to satellite0 star14 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star14)
   goals met: 8 of 11
21. (take_image satellite0 star14 instrument0 image0)
   added: (have_image star14 image0)
   goals met: 9 of 11
22. (turn_to satellite0 star8 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star8)
   goals met: 9 of 11
23. (take_image satellite0 star8 instrument0 image0)
   added: (have_image star8 image0)
   goals met: 10 of 11
24. (turn_to satellite0 star9 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star9)
   goals met: 10 of 11
25. (take_image satellite0 star9 instrument0 image0)
   added: (have_image star9 image0)
   goals met: 11 of 11
